{
    "aboutMeData": "Hello! I am a Fullstack Developer with a passion for creating web and mobile applications. I enjoy solving intricate problems and crafting user-friendly applications using JavaScript, TypeScript, Python, HTML, CSS, and flavors of React. I have developed a diverse skill set by working on various projects at small and large companies, including leading end-to-end solutions and mentoring co-ops at Kinetic Vision, and contributing to high-visibility mobile applications with over 6 million users at iFIT. I transitioned from a background in health and fitness when I discovered my true calling in software development. After graduating college with a Bachelor's degree in Kinesiology, I worked as a Physical Therapy Aide and Fitness Specialist. I discovered that coding was my true passion after teaching myself out of curiosity. So I decided to fully commit and attended Fullstack Academy's immersive software engineering bootcamp, where I gained hands-on experience in fullstack JavaScript and web development. Currently, I am freelancing by training AI models. This website is a work in progress and was built from scratch using Next.js. Last update 6/21/2024.",
    "experienceData": [{"id":1,"company":"DataAnnotations / Outlier.ai","jobTitle":"AI Model Trainer","location":"Cincinnati, OH / Remote","description":"I train AI models by annotating data, comparing model responses, and thoroughly evaluating response quality. I use JavaScript, Python, and SQL to analyze model responses and create code with instructions for prompts. I check for correctness, verbosity, formatting, alignment with prompt instructions, and more.","date":"2024 — Present","tools":["Python","JavaScript","TypeScript","SQL","Django","NumPy","Pandas"]},{"id":2,"company":"Codementor.io","jobTitle":"Software Engineer and Mentor","location":"Cincinnati, OH / Remote","description":"Clients schedule mentoring sessions with me for expert guidance in software development. Provide code reviews, write code for various projects, and debug issues.","date":"2023 — Present","tools":["React","React Native","TypeScript","JavaScript","Data Structures","Algorithms"]},{"id":3,"company":"iFIT","jobTitle":"Software Engineer","location":"Cincinnati, OH / Remote","description":"iFIT is a consumer facing application with around 6 million users globally. I have created new features, fixed bugs, tested features, monitored errors, refactored code, and implemented microservices to create Webviews that are displayed in mobile devices and embedded fitness machines. We used TypeScript, AWS, Lambda Serverless, S3, REST, React, Redux, and Node. Worked on high visibility sections of the app, such as the home screen, pre and post workout screens. Collaborated with other teams and helped teammates learn different repos that I had the most experience on.","date":"2020 — 2022","tools":["React","Node.js","Express","Postgres","TypeScript","AWS (Lambda, S3, CloudWatch)","React Query","Redux"]},{"id":4,"company":"Kinetic Vision","jobTitle":"Full Stack Web Developer","location":"Cincinnati, OH","description":"After my apprenticeship, I worked as a Fullstack Web Developer at Kinetic Vision for 13 months. I started off working closely with and learning from the lead developer, and eventually began leading my own projects with co-ops. At this company, I help plan and develop projects from beginning to end. This includes scoping, estimates, feature design, development, bug fixes, code reviews, documentation, and deployment. I also meet with clients to review features and discuss next steps. In addition, I helped mentor co-ops and other developers improve their skills and share knowledge about different projects.","date":"2019 — 2020","tools":["React","Redux","JavaScript","TypeScript","GraphQL","Node.js","Postgres","Python","Tornado","Django","Server Management","Deployments"]},{"id":5,"company":"84.51","jobTitle":"Developer Apprentice","location":"Cincinnati, OH","description":"After my bootcamp, I did an apprenticeship at 84.51 for about 7 months. I learned a variety of new skills on the job such as Java, Spring Boot, Angular to name a few. I was developing enterprise level, production code while pair programming or working solo. I had a mentor from a company called Launch Scout (formerly named Gaslight) who helped me get up to speed on new languages, frameworks, paradigms, best practices, and more so that I can begin my career on the right foot. The apprenticeship also included book clubs, algorithm challenges, and side projects.","date":"2018 — 2019","tools":["Angular","Spring Boot","TypeScript","Java","Algorithms","OracleDB","RabbitMQ","Agile"]}],
    "projectsData": [{"id":1,"title":"Top 5 Dating App","description":"Dating app that limits how many people a user can stay matched with at a time to encourage more quality communication","technologies":["React Native","Django","MongoDB"],"github":["https://github.com/rawarne2/top-five-frontend", "https://github.com/rawarne2/top-five-backend"], "image": "/coming-soon.png"},{"id":2,"title":"NutriYum","description":"NutriYum is a mobile app built with React Native for iOS and Android. NutriYum keeps track of all the nutrients in what you eat so you don't have to, making your diet management as simple and easy as possible. All you have to do is snap what you eat then bon appétit!","technologies":["React Native","Node.js","Express","Postgres"],"github":["https://github.com/NutriYum/NutriYum"], "image": "/nutri-yum-cam.png","link":"https://www.youtube.com/watch?v=C6Lc_XBkEWU&t=2s&ab_channel=DanFeeney"},{"id":3,"title":"LCA Properties, LLC","description":"Angular and Express.js website displaying information about my mom’s rental properties and provides maintenance request form submissions through email. Desktop and mobile friendly. No longer in use after sale of buildings.","technologies":["Angular","Node.js","Express"],"github":["https://github.com/rawarne2/lca-properties"],"image": "/lca.png","link":"http://www.lcaresidentialproperties.com/"},{"id":4,"title":"NBA Stats Search","description":"This application allows users to search for the major stats of NBA players from the 2023-24 season. It is made using React and Redux","technologies":["React","Node.js","Express"],"github":["https://github.com/rawarne2/nba-stats"],"image": "nba-stats.png","link":"https://nba-stats-search.s3.us-east-2.amazonaws.com/index.html"}],
    "blogsData": [{"id":1,"title":"New JavaScript Features from ECMAScript 2023 (ES14)","image":"image","overview":"The 14th edition of ECMAScript was released in June 2023 and introduced several new features in JavaScript. It includes the array methods toReversed, toSorted, toSpliced, with, findLast, and findLastIndex, as well as hashbang comments support (#!) and the use of Symbols as key in weak collections.","url":"https://medium.com/@Rashaunwarner/new-javascript-features-from-ecmascript-2023-es14-b1c2247bd965"},{"id":2,"title":"Are You Accidentally Rounding Numbers in JavaScript???","image":"image","overview":"Learn how BigInt is used with large numbers to prevent unintentionally rounding.","url":"https://medium.com/@Rashaunwarner/are-you-accidentally-rounding-numbers-in-javascript-c3b90cb04697"},{"id":3,"title":"New ES8 Features","image":"image","overview":"ECMAScript 2017 (ES8) was finalized in June 2017. This article will go over some of the main features that can make your code cleaner and easier to write. This explains how to use new Object and String methods, trailing commas in function parameters, and Async functions.","url":"https://medium.com/@Rashaunwarner/new-es8-features-f3d8b7b4fc8c"}],
    "skillsData": ["HTML","CSS","JavaScript","TypeScript","Python","Java","React","Angular","Redux","React Native","Next.js","Django","Express","Node.js","Git","SQL","MongoDB","Postgres","REST","GraphQL","AWS","Unit Testing","Integration Testing","End-to-End Testing","Data Structures","Algorithms","Authentication","CI/CD","Docker","Agile","Code Reviews"]
}
